#include <Arduino.h>

// Визначаємо цифровий пін, до якого підключимо зовнішній світлодіод.
// Суфікс _OUT одразу підказує, що цей пін працює на вихід.
// #define LED_OUT 15
constexpr uint8_t BLUE_LED = 15; // Визначаємо пін для світлodіod
constexpr uint8_t RED_LED = 16; // Визначаємо пін для світlodіod
constexpr int BLINK_SPEED = 150; // Визначаємо швидкість блимання (мс)

void setup() {
    // Налаштовуємо пін як вихід (OUTPUT), щоб контролер міг подавати на нього напругу
    pinMode(BLUE_LED, OUTPUT);
    pinMode(RED_LED, OUTPUT);
    Serial.begin(115200); // Ініціалізуємо серійний порт для виводу інформації
}

void loop() {
    // Синій: перший спалах
    digitalWrite(BLUE_LED, HIGH); // Вмикаємо синій світлoдіод (подаємо 3.3 В)
    Serial.println("Синій світлoдіод  увімкнено"); // Виводимо повідомлення в серійний порт
    delay(BLINK_SPEED);                 // Чекаємо 0.5 секунду (500 мілісекунд)
    digitalWrite(BLUE_LED, LOW); // Вимикаємо синій світлoдіод  (подаємо 0 В)
    Serial.println("Синій світлoдіод  вимкнено"); // Виводимо повідомлення в серійний порт
    delay(BLINK_SPEED);          // Чекаємо 0.5 секунду (500 мілісекунд)

    // Синій: другий спалах
    digitalWrite(BLUE_LED, HIGH); // Вмикаємо синій світлoдіод  (подаємо 3.3 В)
    Serial.println("Синій світлoдіод  увімкнено"); // Виводимо повідомлення в серійний порт
    delay(BLINK_SPEED);                 // Чекаємо 0.5 секунду (500 мілісекунд)
    digitalWrite(BLUE_LED, LOW); // Вимикаємо синій світлoдіод  (подаємо 0 В)
    Serial.println("Синій світлoдіод  вимкнено"); // Виводимо повідомлення в серійний порт
    delay(BLINK_SPEED);          // Чекаємо 0.5 секунду (500 мілісекунд)

    // Червоний: перший спалах
    digitalWrite(RED_LED, HIGH);  // Вмикаємо червоний світлoдіод  (подаємо 3.3 В)
    Serial.println("Червоний світлoдіод  увімкнено"); // Виводимо повідомлення в серійний порт
    delay(BLINK_SPEED);                 // Чекаємо 0.5 секунду (500 мілісекунд)
    digitalWrite(RED_LED, LOW);  // Вимикаємо червоний світлoдіод  (подаємо 0 В)
    Serial.println("Червоний світлoдіод  вимкнено"); // Виводимо повідомлення в серійний порт
    delay(BLINK_SPEED);                 // Чекаємо 0.5 секунду (500 мілісекунд)
    
    // Червоний: другий спалах
    digitalWrite(RED_LED, HIGH);  // Вмикаємо червоний світлoдіод  (подаємо 3.3 В)
    Serial.println("Червоний світлoдіод  увімкнено"); // Виводимо повідомлення в серійний порт
    delay(BLINK_SPEED);                 // Чекаємо 0.5 секунду (500 мілісекунд)
    digitalWrite(RED_LED, LOW);  // Вимикаємо червоний світлoдіод  (подаємо 0 В)
    Serial.println("Червоний світлoдіод  вимкнено"); // Виводимо повідомлення в серійний порт
    delay(BLINK_SPEED);
}