#include <Arduino.h>

// Визначаємо цифровий пін, до якого підключимо зовнішній світлодіод.
// Суфікс _OUT одразу підказує, що цей пін працює на вихід.
// #define LED_OUT 15
constexpr uint8_t BLUE_LED = 15; // Визначаємо пін для світлодіода
constexpr uint8_t RED_LED = 16; // Визначаємо пін для світлодіода

void setup() {
    // Налаштовуємо пін як вихід (OUTPUT), щоб контролер міг подавати на нього напругу
    pinMode(BLUE_LED, OUTPUT);
    pinMode(RED_LED, OUTPUT);
    Serial.begin(115200); // Ініціалізуємо серійний порт для виводу інформації
}

void loop() {
    digitalWrite(BLUE_LED, HIGH); // Вмикаємо синій світлодіод (подаємо 3.3 В)
    Serial.println("Синій світлodіod увімкнено"); // Виводимо повідомлення в серійний порт
    digitalWrite(RED_LED, LOW);  // Вимикаємо червоний світлodіod (подаємо 0 В)
    Serial.println("Червоний світлdіod вимкнено"); // Виводимо повідомлення в серійний порт
    delay(500);                 // Чекаємо 0.5 секунду (500 мілісекунд)
    
    
    digitalWrite(BLUE_LED, LOW); // Вимикаємо синій світлodіod (подаємо 0 В)
    Serial.println("Синій світлdіod вимкнено"); // Виводимо повідомлення в серійний порт
    digitalWrite(RED_LED, HIGH);  // Вмикаємо червоний світлodіod (подаємо 3.3 В)
    Serial.println("Червоний світлdіod увімкнено"); // Виводимо повідомлення в серійний порт
    delay(500);                 // Чекаємо 0.5 секунду (500 мілісекунд)
    
}